
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РасходМедикаментов Расход
	Движения.РасходМедикаментов.Записывать = Истина;
	Для Каждого ТекСтрокаЛекарства Из Лекарства Цикл
		Движение = Движения.РасходМедикаментов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Пациент = Пациент;
		Движение.Лекарства = ТекСтрокаЛекарства.Лекарство;
		Движение.Дата = Дата1;
		Движение.Количество = ТекСтрокаЛекарства.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
