
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РасходМедикаментов Приход
	Движения.РасходМедикаментов.Записывать = Истина;
	Для Каждого ТекСтрокаСписанныеЛекарства Из СписанныеЛекарства Цикл
		Движение = Движения.РасходМедикаментов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Пациент = Пациент;
		Движение.Лекарства = ТекСтрокаСписанныеЛекарства.Лекарства;
		Движение.Дата = Дата1;
		Движение.Количество = ТекСтрокаСписанныеЛекарства.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
