
&НаКлиенте
Процедура СтоимостьУслугПриИзменении(Элемент)
	Элементы.ТоварыОбщаяСтоимость = Элементы.ТоварыСтоимостьУслуг + Элементы.ТоварыСтоимостьЛекарств + Элементы.ТоварыСтоимостьПитания;
КонецПроцедуры         

&НаКлиенте
Процедура СтоимостьЛекарствПриИзменении(Элемент)
	Элементы.ТоварыОбщаяСтоимость = Элементы.ТоварыСтоимостьУслуг + Элементы.ТоварыСтоимостьЛекарств + Элементы.ТоварыСтоимостьПитания;
КонецПроцедуры  

&НаКлиенте
Процедура СтоимостьПитанияПриИзменении(Элемент)
	Элементы.ТоварыОбщаяСтоимость = Элементы.ТоварыСтоимостьУслуг + Элементы.ТоварыСтоимостьЛекарств + Элементы.ТоварыСтоимостьПитания;
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяСтоимостьПриИзменении(Элемент)
	Элементы.ТоварыОбщаяСтоимость = Элементы.ТоварыСтоимостьУслуг + Элементы.ТоварыСтоимостьЛекарств + Элементы.ТоварыСтоимостьПитания;
КонецПроцедуры





